# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import pandas as pd

import sqlite3
connection = sqlite3.connect('data.sqlite')
cursor = connection.cursor()

def sql_select_to_df(SQL_COMMAND, cursor=cursor):
    results = cursor.execute(SQL_COMMAND).fetchall()
    df = pd.DataFrame(results)
    df.columns = [i[0] for i in cursor.description]
    return df

## Display the names of all the employees in Boston.

In [2]:
sql_select_to_df("""SELECT firstName,lastName FROM employees
                        join offices
                        using(officeCode) WHERE city = 'Boston'
                       """)

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?

In [3]:
office_employees_df = sql_select_to_df("""SELECT officeCode, employeeNumber FROM employees
                        join offices
                        using(officeCode) ORDER BY employeeNumber
                       """)

office_employees_df.groupby('officeCode').count()

# No. All offices have employees.

            employeeNumber
officeCode
1                        6
2                        2
3                        2
4                        5
5                        2
6                        4
7                        2

## Write 3 Questions of your own and answer them

### When were the 5 last orders from NYC customers?

In [5]:
latest_orders_NYC_df = sql_select_to_df("""SELECT orderDate FROM orders
                        join customers
                        using(customerNumber) WHERE city = 'NYC' ORDER BY orderDate DESC LIMIT 5
                       """)

latest_orders_NYC_df #.groupby('productName').sum()

    orderDate
0  2004-12-01
1  2004-11-21
2  2004-11-15
3  2004-11-05
4  2004-11-03

### From which country do customers order most products?

In [6]:
country_orders_df = sql_select_to_df("""SELECT country, orderNumber FROM orders
                        join customers
                        using(customerNumber)
                       """)

country_order_frequency_df = country_orders_df.groupby('country').count()
country_order_frequency_df = country_order_frequency_df.sort_values('orderNumber',ascending=False)
country_order_frequency_df.index[0]

'USA'

### Which employee sold the most in the entire USA?

In [15]:
employee_sales_df = sql_select_to_df("""SELECT customerNumber, employeeNumber FROM customers c
                        join employees e
                        on c.salesRepEmployeeNumber = e.employeeNumber
                        WHERE country = 'USA'; 
                       """)

employee_sales_df = employee_sales_df.groupby('employeeNumber').count()
employee_sales_df

                customerNumber
employeeNumber
1165                         6
1166                         6
1188                         6
1216                         6
1286                         6
1323                         6

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!